{"templateIndex":1,"sharedHashesByProp":{},"data":{"posts":[{"id":1,"author":"Michael Smith","date":"2019/01/24","title":"Hello World","body":["Welcome to the new blog of External Techs.","We'll regularly be updating you on our thoughts about the current tech scene in London and our thoughts on upcoming technologies."]},{"id":2,"author":"Michael Smith","date":"2019/03/21","title":"Hack Days and Free Projects","body":["I recently went to a meetup organised by shop.LEGO.com.","The meetup was enjoyable and if you get a chance to go to one in the future, I recommend it. They had five talks in total on a range of  topics. From testing to devops and dev in-between. All would be easily accessible to junior level devs. I can say I took something away from each talk and there was very little I could disagree with.","One of the most interesting talks by two junior devs about a open graphQL api they’re building for the store. They’re given time out from their usually work to week to build it. They talked about their experiences and how much it’s helped improve their skills.","I feel allocating time to these side projects is so beneficial to employees and in turn helps the company as well. I’ve experienced it a few time, sometimes in the form of hack days, and other times it was more structured, having an afternoon every week. Not only do these events improved and broaden the teams technical skills, but they have a massive impact on skills needed in the business. Understanding what the MVP is, estimating work, understanding what is going to provide the greatest benefit, working as a team, delivery etc.","Often when we are working on these monolithic platforms you can lose sight of some of these things, and especially for juniors who have never worked on anything else, they miss out on these key skills, that will help them progress. In addition, the projects they produce can often end up meeting a business need and could end up being the prototype for a new feature or product for the company.","So in summary, a hack day every now and then isn’t going to cost your company the world, but it will drastically improve your staffs skills and you might even get something you can turn into a product out of it. Though if you do plan to go ahead, you do need some structure in place, this dev time can easily become too unfocused and unproductive."]}]},"path":"blog"}
